yii/frontend/controllers/AsuranceController.php

SELECT `id`, `source_country` FROM `insurance_countries`
---
        $adultPassenger = $model->adult ? "adult" : null;
        $childrenPassenger = $model->children ? "child" : null;

        $sourceCountries = InsuranceCountries::find()
            ->select(['id', 'source_country'])
            ->asArray()
            ->all();

SELECT * FROM `plans` WHERE (`insurance_id`='17') AND (`source_id`=14) AND (`min_age` BETWEEN 19 AND 75) AND (`max_age` BETWEEN 19 AND 75) AND (`plan_code` NOT LIKE '%USCA%')
---
        function getPlans($insuranceId, $sourceId, $planCodeLike, $planCodeNotLike, $minAge, $maxAge) {
            $plans = Plans::find()
                ->where(['insurance_id' => $insuranceId])
                ->andWhere(['source_id' => $sourceId])
                ->andWhere(['between', 'min_age', $minAge, $maxAge])
                ->andWhere(['between', 'max_age', $minAge, $maxAge]);

            if ($planCodeLike) {
                $plans->andWhere(['like', 'plan_code', $planCodeLike]);
            }

            if ($planCodeNotLike) {
                $plans->andWhere(['not like', 'plan_code', $planCodeNotLike]);
            }
            // dd( $plans);
            return $plans->all();

SELECT * FROM `pricing` WHERE (`plan_id`='159') AND (`duration`='7')
---
        if ($model->load(Yii::$app->request->post())) {
            // dd($model->type);
            $passengers = $model->adult + $model->children + $model->adult_senior;
            $pricing = Pricing::find()
                ->where(['plan_id' => $model->plan])
                ->andWhere(['duration' => $model->duration])
                ->one();

SELECT * FROM `insurance_countries` WHERE `id`=5
---
        }


        $insuranceCountry = InsuranceCountries::findOne($id);

SELECT * FROM `pricing` WHERE (`plan_id`=159) AND (`duration`='7')
---
        foreach ($plans as $plan) {
            $insuranceTitle = $plan->insurance->name;
            $insuranceTitleAr = $plan->insurance->name_ar;
            $price = Pricing::find()
                ->where(['plan_id' => $plan->id])
                ->andWhere(['duration' => $model->duration])
                ->one();

SELECT * FROM `countries` WHERE `code`='JO'
---
    protected function getCountryName($countryCode)
    {
        $country = Countries::findOne(['code' => $countryCode]);

SELECT * FROM `policy_draft` WHERE `id`='44'
---
    public function actionPassengers($draft, $passengers = null)
    {




        // if ($language !== null) {
        //     Yii::$app->language = $language;
        // }
        $decodedDraft = base64_decode($draft);
        $policy = PolicyDraft::findOne($decodedDraft);

SELECT * FROM `policy_draft_passengers` WHERE (`draft_id`=60) AND ((`first_name`='AHMAD') AND (`middle_name`='MAJED ABDALLAH') AND (`last_name`='ABUTAHA'))
---
                                    continue;
                                }

                                $existingRecord = PolicyDraftPassengers::find()
                                    ->where(['draft_id' => $policy->id])
                                    ->andWhere([
                                        'first_name' => $json_request['result']['firstName'] ?? "null",
                                        'middle_name' => $json_request['result']['middleName'] ?? "null",
                                        'last_name' => $json_request['result']['lastName'] ?? "null"
                                    ])
                                    ->one();

INSERT INTO `policy_draft_passengers` (`draft_id`, `id_number`, `first_name`, `middle_name`, `last_name`, `dob`, `id_type`, `country`, `nationality`, `gender`, `warning`, `document_link`, `created_at`, `updated_at`) VALUES (60, 'S188701', 'AHMAD', 'MAJED ABDALLAH', 'ABUTAHA', '1994/12/10', 'Passport', 'JO', 'JO', 'Male', 'Predicted age of photo is 48, 29 shown on document', '/uploads/150740353-1721302673.1726387294jpg', 1726387301, 1726387301)
---
                                    $PolicyDraftPassengers->id_type = ($json_request['result']['documentType'] ?? "null") === 'P' ? 'Passport' : $PolicyDraftPassengers->id_type;
                                    $PolicyDraftPassengers->warning = isset($json_request['authentication']['warning']) ? implode(',', $json_request['authentication']['warning']) : "null";
                                    $PolicyDraftPassengers->document_link = '/uploads/' . $fileName;
                                    $PolicyDraftPassengers->save();

SELECT * FROM `policy_draft_passengers` WHERE `draft_id`=44
---
        $model->addRule($attr, 'required');


        $savedFiles = PolicyDraftPassengers::find()
            ->where(['draft_id' => $policy->id])
            ->all();

SELECT * FROM `policy_draft` WHERE `id`='98'
---
    public function actionReview($draft, $id = null)
    {
        $decodedDraft = base64_decode($draft);
        $policy = PolicyDraft::findOne($decodedDraft);

SELECT * FROM `customers` WHERE `mobile`='+962790751376'
SELECT * FROM `policy` WHERE `customer_id`=8 ORDER BY `created_at` DESC
---
    public function actionDisplayPolicy($policyIds = null, $id = null)
    {

        $decodedPolicyIds = array_map('base64_decode', explode(',', $policyIds));

        $id = base64_decode($id);
        $request = Yii::$app->request;
        $policyDraft = $request->get('policyDraft');

        $mobile = Yii::$app->session->get('mobile');
        $customer = Customers::findOne(['mobile' => $mobile]);

        if ($customer) {

            $policies = Policy::find()->where(['customer_id' => $customer->id])->orderBy(['created_at' => SORT_DESC])->all();

SELECT * FROM `policy_draft` WHERE `id`='111'
SELECT * FROM `policy_draft_passengers` WHERE `draft_id`='111'
SELECT * FROM `customers` WHERE `mobile`='+962789456123'
---
    public function actionPayment($id, $method)
    {
        $id = base64_decode($id);
        $policyDraft = PolicyDraft::findOne($id);

        if ($policyDraft !== null) {

            $policyDraft->paymentmethod = $method;

            $policyDraft->setScenario(PolicyDraft::SCENARIO_UPDATE);

            if (!$policyDraft->save(false)) {
                throw new \Exception('Failed to update policy draft');
            }
        }

        $passengers = PolicyDraftPassengers::find()->where(['draft_id' => $id])->all();

        if ($policyDraft === null) {
            throw new NotFoundHttpException('The requested policy does not exist.');
        }

        $customer = Customers::findOne(['mobile' => $policyDraft->mobile]);