yii/frontend/controllers/AsuranceController.php

        $adultPassenger = $model->adult ? "adult" : null;
        $childrenPassenger = $model->children ? "child" : null;

        $sourceCountries = InsuranceCountries::find()
            ->select(['id', 'source_country'])
            ->asArray()
            ->all();
---
SELECT `id`, `source_country` FROM `insurance_countries`

        function getPlans($insuranceId, $sourceId, $planCodeLike, $planCodeNotLike, $minAge, $maxAge)
        {
            $plans = Plans::find()
                ->where(['insurance_id' => $insuranceId])
                ->andWhere(['source_id' => $sourceId])
                ->andWhere(['between', 'min_age', $minAge, $maxAge])
                ->andWhere(['between', 'max_age', $minAge, $maxAge]);

            if ($planCodeLike) {
                $plans->andWhere(['like', 'plan_code', $planCodeLike]);
            }

            if ($planCodeNotLike) {
                $plans->andWhere(['not like', 'plan_code', $planCodeNotLike]);
            }
            // dd( $plans);
            return $plans->all();
---
SELECT * FROM `plans` WHERE (`insurance_id`='6') AND (`source_id`=5) AND (`min_age` BETWEEN 19 AND 75) AND (`max_age` BETWEEN 19 AND 75) AND (`plan_code` NOT LIKE '%USCA%')

    protected function getCountryName($countryCode)
    {
        $country = Countries::findOne(['code' => $countryCode]);
---
SELECT * FROM `countries` WHERE `code`='Jordan'

    public function actionReview($draft, $id = null)
    {
        $decodedDraft = base64_decode($draft);
        $policy = PolicyDraft::findOne($decodedDraft);
---
SELECT * FROM `policy_draft` WHERE `id`='211'

            $customer->credit -= $totalPrice;


            $customer->save(false);
---
UPDATE `customers` SET `credit`=0 WHERE `id`=2

        // dd(  $apiPayload);
        $apiResponseData = json_decode($apiResponse, true);

        $customer = Customers::findOne(['mobile' => $policyDraft->mobile]);
---
SELECT * FROM `customers` WHERE `mobile`='+962790751376'

        $paymentmethod->customer_id = $customer->id;
        $paymentmethod->method = $policyDraft->paymentmethod;
        $paymentmethod->response = $apiResponseData['message'] ?? "null";
        $paymentmethod->save();
---
INSERT INTO `paymentmethods` (`customer_id`, `method`, `response`) VALUES (2, 'meps', 'Policies has been requested successfully')

    protected function processView($policyDraft, $passengers, $apiResponseData)
    {

        $id = $apiResponseData['id'];
        // dd($apiResponseData);


        $customer = Customers::findOne(['mobile' => $policyDraft->mobile]);
---
SELECT * FROM `customers` WHERE `id`=2

            $policy->status = $apiResponseData['status'] ?? 0;
            $policy->status_description = $apiResponseData['status_description'] ?? 'Processing';

            if ($policy->save()) {
---
INSERT INTO `policy` (`customer_id`, `source`, `from_airport`, `DepartCountryCode`, `departure_date`, `going_to`, `ArrivalCountryCode`, `return_date`, `name`, `price`, `ProposalState`, `ItineraryID`, `PNR`, `PolicyNo`, `PolicyPurchasedDateTime`, `PolicyURLLink`, `status`, `status_description`, `created_at`, `updated_at`) VALUES (2, 0, 'AMM', 'JO', '2024-12-10', 'BEY', 'LB', '2024-12-16', 'JULIA BLAIBLEH', 0, 'Proposal State', '0bc4bdff-e9a2-43de-9fe9-62dc428c2442', '', '', '2024-12-08 23:18:39', '', 0, 'Processing', 1733696319, 1733696319)