yii/frontend/controllers/AsuranceController.php

SELECT `id`, `source_country` FROM `insurance_countries`
---
        $adultPassenger = $model->adult ? "adult" : null;
        $childrenPassenger = $model->children ? "child" : null;

        $sourceCountries = InsuranceCountries::find()
            ->select(['id', 'source_country'])
            ->asArray()
            ->all();

SELECT * FROM `pricing` WHERE (`plan_id`='159') AND (`duration`='7')
---
        if ($model->load(Yii::$app->request->post())) {
            // dd($model->type);
            $passengers = $model->adult + $model->children + $model->adult_senior;
            $pricing = Pricing::find()
                ->where(['plan_id' => $model->plan])
                ->andWhere(['duration' => $model->duration])
                ->one();