yii/frontend/controllers/InsuranceController.php

    public function actionPrograms($slug = null)
    {
        if ($slug === null) {
            $firstInsurance = Insurances::find()->orderBy(['id' => SORT_ASC])->one();
            if ($firstInsurance !== null) {
                $slug = $firstInsurance->slug;
            } else {
                throw new NotFoundHttpException('No insurance records found.');
            }
        }
        // $country = InsuranceCountries::findOne(['slug' => $slug]);
        $insurance = Insurances::findOne(['slug' => $slug]);
---
SELECT * FROM `insurances` WHERE `slug`='travel-medical'