yii/frontend/views/site/index.php

SELECT * FROM `insurance_countries`
---
        <div class="row">
            <div class="col-lg-10 offset-lg-<?= $languageDirection = Yii::$app->language == 'ar' ? 'rtl' : 'ltr' ?>-1 col-12" data-cue="fadeIn">
                <ul class="list-inline text-center">
                    <?php foreach (\common\models\InsuranceCountries::find()->all() as $country) : ?>

SELECT * FROM `insurance_countries`
---


                <div class="swiper logoSwiper swiper-initialized swiper-horizontal swiper-backface-hidden" data-cue="slideInDown" data-show="true" style="animation-name: slideInDown; animation-duration: 600ms; animation-timing-function: ease; animation-delay: 0ms; animation-direction: normal; animation-fill-mode: both;">
                    <?php foreach (\common\models\InsuranceCountries::find()->all() as $Countries) : ?>

SELECT * FROM `insurances`
---
            </div>
        </div>

        <?php foreach (\common\models\Insurances::find()->all() as $insurance): ?>

SELECT * FROM `insurances`
---
            <?php endforeach; ?>

            <?php
            $allInsurances = \common\models\Insurances::find()->all();

SELECT * FROM `insurances`
---
            </div>
        </div>
        <div class="row">
            <?php foreach (\common\models\Insurances::find()->all() as $insurance): ?>

SELECT COUNT(*) FROM `customers`
---
                            <path d="M15 14s1 0 1-1-1-4-5-4-5 3-5 4 1 1 1 1h8zm-7.978-1A.261.261 0 0 1 7 12.996c.001-.264.167-1.03.76-1.72C8.312 10.629 9.282 10 11 10c1.717 0 2.687.63 3.24 1.276.593.69.758 1.457.76 1.72l-.008.002a.274.274 0 0 1-.014.002H7.022zM11 7a2 2 0 1 0 0-4 2 2 0 0 0 0 4zm3-2a3 3 0 1 1-6 0 3 3 0 0 1 6 0zM6.936 9.28a5.88 5.88 0 0 0-1.23-.247A7.35 7.35 0 0 0 5 9c-4 0-5 3-5 4 0 .667.333 1 1 1h4.216A2.238 2.238 0 0 1 5 13c0-1.01.377-2.042 1.09-2.904.243-.294.526-.569.846-.816zM4.92 10A5.493 5.493 0 0 0 4 13H1c0-.26.164-1.03.76-1.724.545-.636 1.492-1.256 3.16-1.275zM1.5 5.5a3 3 0 1 1 6 0 3 3 0 0 1-6 0zm3-2a2 2 0 1 0 0 4 2 2 0 0 0 0-4z" />
                        </svg>
                    </div>
                    <h3 class="fs-2 fw-bold m-1 text-white mt-2"><?= Customers::find()->count() . ' +'; ?></h3>

SELECT COUNT(*) FROM `insurances`
---
                            </g>
                        </svg>
                    </div>
                    <h3 class="fw-bold m-1 fs-2  mt-2 text-warning"><?= Insurances::find()->count() . ' +'; ?></h3>

SELECT COUNT(*) FROM `policy`
---
                        </svg>

                    </div>
                    <h3 class=" fw-bold m-1 fs-2  text-white mt-2"><?= Policy::find()->count() . ' +'; ?></h3>

SELECT COUNT(*) FROM `insurance_countries`
---
                            </g>
                        </svg>
                    </div>
                    <h3 class=" fw-bold m-1 fs-2 mt-2 text-warning"><?= InsuranceCountries::find()->count() . ' +'; ?></h3>

SELECT COUNT(*) FROM `insurances`
---
            <!-- <div class="row border-primary border-top g-5 g-lg-0 text-center text-lg-end"> -->
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary ">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= Insurances::find()->count() ?>">0 </h5>

SELECT COUNT(*) FROM `insurance_countries`
---
            </div>
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= InsuranceCountries::find()->count() ?>">0 </h5>

SELECT COUNT(*) FROM `insurances`
---
            </div>
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= Insurances::find()->count() ?>">0 </h5>

SELECT COUNT(*) FROM `policy`
---
            </div>
            <div class="col-lg-3 col-6 border-end-0">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable  mb-0 counter" data-count="<?= Policy::find()->count() ?>">0 </h5>

SELECT * FROM `insurance_countries`
---
        <div class="row ">
            <div class="col-lg-8 ">
                <div class="row">
                    <?php foreach (\common\models\InsuranceCountries::find()->all() as $Countries) : ?>