yii/backend/controllers/CountryController.php

    protected function findModel($id)
    {
        if (($model = Countries::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `countries` WHERE `id`='35'