yii/frontend/views/insurance/about.php

        <div class="row border-primary border-top g-5 g-lg-0 text-center text-lg-start">
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= Insurances::find()->count()  ?>">0 </h5>
---
SELECT COUNT(*) FROM `insurances`

            </div>
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= InsuranceCountries::find()->count()  ?>">0 </h5>
---
SELECT COUNT(*) FROM `insurance_countries`

            </div>
            <div class="col-lg-3 col-6 border-end-lg border-md-0 border-lg-primary">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= Insurances::find()->count()  ?>">0 </h5>
---
SELECT COUNT(*) FROM `insurances`

            </div>
            <div class="col-lg-3 col-6">
                <div class="p-lg-5">
                    <h5 class="h1 text-white-stable mb-0 counter" data-count="<?= Policy::find()->count() ?>">0 </h5>
---
SELECT COUNT(*) FROM `policy`