yii/frontend/views/insurance/from.php

// }


$insuranceId = Insurances::find()
    ->select('id')
    ->where(['like', 'LOWER(name)', 'travel'])
    ->one()??null;
---
SELECT `id` FROM `insurances` WHERE LOWER(name) LIKE '%travel%'

                    <span class="text-danger">*</span>
                </label>
                <?php
                $countries = Countries::find()->orderBy('name_en')->all();
---
SELECT * FROM `countries` ORDER BY `name_en`

                </label>
                <?php

    $countries = Countries::find()->orderBy('name_en')->all();
---
SELECT * FROM `countries` ORDER BY `name_en`