yii/frontend/views/insurance/index.php

                                </tr>
                        </thead>
                        <tbody >
                            <?php foreach (\common\models\PlansItems::find()->where(['insurance_id' => $model->type])->all() as $planitem) : ?>
---
SELECT * FROM `plans_items` WHERE `insurance_id`='6'


                                        <td>
                                            <?php
                                            $planCoverage = \common\models\PlansCoverage::find()->where(['item_id' => $planitem->id, 'plan_id' => $plan->id])->one();
---
SELECT * FROM `plans_coverage` WHERE (`item_id`=753) AND (`plan_id`=159)