yii/frontend/views/insurance/insurances.php

    <div class="container" data-cue="fadeIn">

        <div class="row">
            <?php foreach (\common\models\Insurances::find()->all() as $insurance): ?>
---
SELECT * FROM `insurances`

                        </div>

                        <div class="card-body row">
                            <?php foreach (\common\models\Insurances::find()->all() as $insurance): ?>
---
SELECT * FROM `insurances`