yii/frontend/views/insurance/passengers.php

                                <?php $form = ActiveForm::begin(['options' => ['enctype' => 'multipart/form-data', 'class' => 'row needs-validation g-3']]) ?>
                                <div class="col-md-6">
                                    <label class="form-label" for="from_airport"><?= Yii::t('app', 'From Airport') ?></label>
                                    <?= $form->field($policy, 'from_airport')->dropDownList(
                                        \yii\helpers\ArrayHelper::map(
                                            \common\models\Airports::find()
                                                ->leftJoin('countries', 'countries.code = airports.countryCode')->where(['countries.code' => $policy->DepartCountryCode])
                                                ->all(),
                                            'code',
                                            'name'
                                        )
                                    )->label(false);  ?>
                                </div>
                                <div class="col-md-6">
                                    <label class="form-label" for="going_to"><?= Yii::t('app', 'Going to') ?></label>
                                    <?= $form->field($policy, 'going_to')->dropDownList(
                                        \yii\helpers\ArrayHelper::map(
                                            \common\models\Airports::find()
                                                ->leftJoin('countries', 'countries.code = airports.countryCode')
                                                ->where(['countries.code' => $policy->ArrivalCountryCode])
                                                ->all(),
                                            'code',
                                            'name'
                                        )
                                    )->label(false);  ?>
---
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='JO'
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='AR'

        <div class="row">
            <div class="col-md-6">
                <label class="form-label" for="from_airport"><?= Yii::t('app', 'From Airport') ?></label>
                <?= $form->field($policy, 'from_airport')->dropDownList(
                    \yii\helpers\ArrayHelper::map(
                        \common\models\Airports::find()
                            ->leftJoin('countries', 'countries.code = airports.countryCode')
                            ->where(['countries.code' => $policy->DepartCountryCode])
                            ->all(),
                        'code',
                        'name'
                    )
                )->label(false); ?>
            </div>
            <div class="col-md-6">
                <label class="form-label" for="going_to"><?= Yii::t('app', 'Going to') ?></label>
                <?= $form->field($policy, 'going_to')->dropDownList(
                    \yii\helpers\ArrayHelper::map(
                        \common\models\Airports::find()
                            ->leftJoin('countries', 'countries.code = airports.countryCode')
                            ->where(['countries.code' => $policy->ArrivalCountryCode])
                            ->all(),
                        'code',
                        'name'
                    )
                )->label(false); ?>
---
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='JO'
SELECT `airports`.* FROM `airports` LEFT JOIN `countries` ON countries.code = airports.countryCode WHERE `countries`.`code`='AR'