yii/frontend/views/insurance/programs.php

SELECT * FROM `insurance_countries` WHERE `insurance_id`=6
---
        <div class="row ">
            <div class="col-lg-8 ">
                <div class="row">
                    <?php foreach (\common\models\InsuranceCountries::find()->where(['insurance_id' => $insurance->id])->all() as $Countries) : ?>

SELECT * FROM `insurance_countries`
---
            <div class="col-lg-8 offset-lg-2">
                <div class="row row row-cols-2 row-cols-lg-4 row-cols-md-3 justify-content-center g-5">

                    <?php foreach (\common\models\InsuranceCountries::find()->all() as $Countries) : ?>