yii/frontend/views/insurance/review.php

                                                </table>
                                            </td>
                                        </tr>
                                        <?php $customer = Customers::findOne(['mobile' => $policy->mobile]); ?>
---
SELECT * FROM `customers` WHERE `mobile`='+962790751376'